import React from "react";
import * as styles from "../privacyPolicy/Main.module.sass";

function IndexPage() {
  // window.location.href('/')
  return (
    <section>
    <h2>
      Share Buy List プライバシポリシー
    </h2>
    <h3>
      個人情報保護方針
    </h3>
    <p>
      yamamotoと申します。
      yamamotoは、シンプル予算管理アプリを無料アプリとして作成しました。<br />
      このサービスはyamamotoが無料で提供しており、そのまま使用することを目的としています。<br />
    </p>
    <p>
      このページは、誰かが私のサービスを使用することを決めた場合に、個人情報の収集、使用、開示に関する私のポリシーについて訪問者に知らせるために使用されます。<br />
      私のサービスを使用することを選択した場合、このポリシーに関連する情報の収集と使用に同意したものとします。収集する個人情報は、サービスの提供と改善に使用されます。このプライバシーポリシーに記載されている場合を除き、お客様の情報を使用したり、他人と共有したりすることはありません。
    </p>
    <p>
      このプライバシーポリシーで使用される用語は、このプライバシーポリシーで別途定義されていない限り、「シンプル予算管理」でアクセスできる利用規約と同じ意味を持ちます。
    </p>
    <h3>
      情報の収集と使用
    </h3>
    <p>
      より良い体験のために、私たちのサービスを使用している間、特定の個人情報を提供するようにあなたに要求する場合があります。要求する情報はあなたのデバイスに保存され、いかなる方法でも収集されません。<br />
      アプリは、あなたを識別するために使用される情報を収集する可能性のあるサードパーティのサービスを使用します。
    </p>
    <p>
      アプリで使用されるサードパーティのサービスプロバイダーのプライバシーポリシーへのリンク<br />
      <a href="https://support.google.com/admob/answer/6128543?hl=en">AdMob</a><br />
    </p>
    <h3>
      ログデータ
    </h3>
    <p>
      サービスを使用するたびに、アプリでエラーが発生した場合、ログデータと呼ばれる電話でデータと情報を（サードパーティ製品を通じて）収集することをお知らせします。このログデータには、デバイスのインターネットプロトコル（「IP」）アドレス、デバイス名、オペレーティングシステムのバージョン、サービスを利用する際のアプリの構成、サービスの使用日時、その他の統計などの情報が含まれる場合があります。
    </p>
    <h3>
      クッキー
    </h3>
    <p>
      Cookieは、匿名の一意の識別子として一般的に使用される少量のデータを含むファイルです。これらは、アクセスしたWebサイトからブラウザに送信され、デバイスの内部メモリに保存されます。
    </p>
    <p>
      このサービスはこれらの「Cookie」を明示的に使用しません。ただし、アプリは情報を収集してサービスを改善するために「Cookie」を使用するサードパーティのコードとライブラリを使用する場合があります。これらのCookieを受け入れるか拒否し、Cookieがいつデバイスに送信されるかを知るオプションがあります。クッキーを拒否することを選択した場合、このサービスの一部を使用できない場合があります。
    </p>
    <h3>
      サービスプロバイダー
    </h3>
    <p>
      次の理由により、サードパーティの企業や個人を雇用する場合があります。
    </p>
    <p>
      サービスを促進するため。<br />
      当社に代わってサービスを提供するため。<br />
      サービス関連のサービスを実行するには; または<br />
      サービスの使用方法の分析を支援するため。<br />
      これらの第三者があなたの個人情報にアクセスできることをこのサービスのユーザーに通知したいと思います。その理由は、私たちに代わって割り当てられたタスクを実行するためです。ただし、他の目的で情報を開示または使用しないことが義務付けられています。
    </p>
    <h3>
      セキュリティ
    </h3>
    <p>
      個人情報の提供に対するお客様の信頼を大切にしています。したがって、商業的に許容される保護手段を使用して保護するよう努めています。しかし、インターネットを介した伝送方法、または電子ストレージの方法が100％安全で信頼できるものではないことを忘れないでください。絶対的な安全性は保証できません。
    </p>
    <h3>
      他のサイトへのリンク
    </h3>
    <p>
      このサービスには、他のサイトへのリンクが含まれている場合があります。サードパーティのリンクをクリックすると、そのサイトに移動します。これらの外部サイトは私によって運営されていないことに注意してください。したがって、これらのWebサイトのプライバシーポリシーを確認することを強くお勧めします。私は、サードパーティのサイトまたはサービスのコンテンツ、プライバシーポリシー、または慣行を管理しておらず、責任を負いません。
    </p>
    <h3>
      子どものプライバシー
    </h3>
    <p>
      これらのサービスは13歳未満の人には対応していません。13歳未満の子供から個人を特定できる情報を意図的に収集することはありません。あなたが親または保護者であり、あなたの子供が私たちに個人情報を提供したことを知っている場合、私に連絡して必要な行動をとることができます。
    </p>
    <h3>
      このプライバシーポリシーの変更
    </h3>
    <p>
      プライバシーポリシーを随時更新する場合があります。したがって、変更がある場合はこのページを定期的に確認することをお勧めします。このページに新しいプライバシーポリシーを掲載して、変更をお知らせします。これらの変更は、このページに投稿された直後に有効になります。
    </p>
    <h3>
      お問い合わせ
    </h3>
    <p>
      このプライバシーポリシーについてご質問やご提案がございましたら、k72879 @ gmail.comまでお気軽にお問い合わせください。
    </p>
    </section>
  );
}

export default IndexPage;

